bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer/main.c
#define APP_Task_start_audio_START_SEC_CODE
#include "tpl_memmap.h"


TASK(start_audio){

	GPIO_PinModeSet(gpioPortA, 14, gpioModeInput, 0);
    GPIO_IntConfig(gpioPortA, 14, true, true, true);
	bool microphone_ext = GPIO_PinInGet(gpioPortA, 14) == 0;
	// Data Microphone on PD7

	// Enable Microphone on PE0 --> Disable GPIO 
	GPIO_PinOutClear(gpioPortE, 0);
	// Enable VREF on PA11 to power Microphone
	GPIO_PinOutSet(gpioPortA, 11);
	/* Setup OpAmp */
	CMU_ClockEnable(cmuClock_DAC0, true);
	/* Define the configuration for OPA1 and OPA2 */
	OPAMP_Init_TypeDef opa1Init = OPA_INIT_INVERTING;
	OPAMP_Init_TypeDef opa2Init = OPA_INIT_INVERTING_OPA2;
	opa2Init.outPen = DAC_OPA2MUX_OUTPEN_OUT1;
	/* Set the gain */
    static OPAMP_ResSel_TypeDef opamp1NormalGainRange[] = {opaResSelR2eq4_33R1, opaResSelR2eq7R1, opaResSelR2eq15R1, opaResSelR2eq15R1, opaResSelR2eq15R1};
    static OPAMP_ResSel_TypeDef opamp2NormalGainRange[] = {opaResSelR2eqR1, opaResSelR2eqR1, opaResSelR2eqR1, opaResSelR1eq1_67R1, opaResSelR2eq2R1};
    static OPAMP_ResSel_TypeDef opamp1LowGainRange[] = {opaResSelR2eq0_33R1, opaResSelR2eq0_33R1, opaResSelR2eqR1, opaResSelR2eqR1, opaResSelR2eqR1};
    static OPAMP_ResSel_TypeDef opamp2LowGainRange[] = {opaResSelR2eqR1, opaResSelR1eq1_67R1, opaResSelR2eqR1, opaResSelR1eq1_67R1, opaResSelR2eq2R1};
    OPAMP_ResSel_TypeDef *opamp1Gain = 4 == 0 ? opamp1LowGainRange : opamp1NormalGainRange;
    OPAMP_ResSel_TypeDef *opamp2Gain = 4 == 0 ? opamp2LowGainRange : opamp2NormalGainRange;
    uint32_t index = MAX(0, MIN(1, 4));
    opa1Init.resSel = opamp1Gain[index];
    opa2Init.resSel = opamp2Gain[index];
	/* Enable OPA1 and OPA2 */
    OPAMP_Enable(DAC0, OPA1, &opa1Init);
    OPAMP_Enable(DAC0, OPA2, &opa2Init);
    /* Disable the clock */
    CMU_ClockEnable(cmuClock_DAC0, false);
	/* Now setup ADC */
	// Start the clock
	CMU_ClockEnable(cmuClock_ADC0, true);
	ADC_Reset(ADC0);
	// Setup ADC structure
	ADC_Init_TypeDef adcInit = ADC_INIT_DEFAULT;
	adcInit.prescale = (4 - 1);
	adcInit.warmUpMode = adcWarmupKeepADCWarm;
	adcInit.timebase = ADC_TimebaseCalc(0);
	adcInit.lpfMode = adcLPFilterRC;
	// Initialize ADC
	ADC_Init(ADC0, &adcInit);
	/* SCAN mode voltage reference must match the reference selected for SINGLE mode conversions */
	// Reset and set 2.5V Ref
	ADC0->SCANCTRL = ADC_SCANCTRL_REF_2V5;
	/* Configure ADC single conversion structure */
	ADC_InitSingle_TypeDef adcSingleInit = ADC_INITSINGLE_DEFAULT;
	adcSingleInit.prsSel = adcPRSSELCh0;
    adcSingleInit.reference = adcRef2V5;
	adcSingleInit.resolution = adcRes12Bit;
	adcSingleInit.input = adcSingleInpCh0Ch1;
	adcSingleInit.prsEnable = true;
    adcSingleInit.diff = true;
    adcSingleInit.rep = false;
	adcSingleInit.acqTime = adcAcqTime8;
	ADC_InitSingle(ADC0, &adcSingleInit);
	/* Enable ADC interrupt vector */
	ADC_IntClear(ADC0, ADC_IEN_SINGLE);
    // ADC_IntEnable(ADC0, ADC_IEN_SINGLE);
	/* NVIC is only possible on privileged mode, so only in kernel mode */
    // NVIC_ClearPendingIRQ(ADC0_IRQn);
    // NVIC_EnableIRQ(ADC0_IRQn);
	ChainTask(start_dma);
}
#define APP_Task_start_audio_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_Task_start_dma_START_SEC_CODE
#include "tpl_memmap.h"
static int16_t primaryBuffer[1024];
static int16_t secondaryBuffer[1024];
const uint16_t numberOfSamplesPerTransfer = 1024;
static bool isPrimaryDMABuffer = true;

static void dma_callback(void){
	/* Switch buffer */
	// isPrimaryDMABuffer = !isPrimaryDMABuffer;
	// /* Re-activate the DMA */
    // DMA_RefreshPingPong(0,
    //     isPrimaryDMABuffer,						/* bool to change between dma descriptor, primaryBuffer or secondaryBuffer DST*/
    //     false,
    //     NULL,									/* dst : NULL = same as in descriptor, thus same as in start dma TASK, (void*)primaryBuffer or (void*)secondaryBuffer */
    //     NULL,									/* src : NULL = same as in descriptor, thus same as in start dma TASK, (void*)&(ADC0->SINGLEDATA) */
    //     numberOfSamplesPerTransfer - 1,
    //     false);
	/* With Trampoline, SetEvent to schedule the task dma buffer --> sram ext buffer */
	// SetEvent();
	return;
}



TASK(start_dma){
	/* ADC and Timer is started, now link to DMA */
	CMU_ClockEnable(cmuClock_DMA, true);
	/* Initialise the DMA structure */
    DMA_Init_TypeDef dmaInit;
	dmaInit.hprot = 0;
    dmaInit.controlBlock = dmaControlBlock;
	DMA_Init(&dmaInit);
	/* Configure call-back when DMA transfert done */
	DMA_CB_TypeDef cb;
	/*****************************************  CALLBACK DOESNT WORK !  ********************************************************/
	cb.cbFunc = dma_callback;
    cb.userPtr = NULL;
	/* Setup channel */
	DMA_CfgChannel_TypeDef chnlCfg;
	chnlCfg.highPri = false;
    chnlCfg.enableInt = true;
    chnlCfg.select = DMAREQ_ADC0_SINGLE;
	chnlCfg.cb = &cb;
    DMA_CfgChannel(0, &chnlCfg);
	/* Setting up channel descriptor */
    DMA_CfgDescr_TypeDef descrCfg;
    descrCfg.dstInc = dmaDataInc2;
    descrCfg.srcInc = dmaDataIncNone;
    descrCfg.size = dmaDataSize2;
    descrCfg.arbRate = dmaArbitrate1;
    descrCfg.hprot = 0;
	/* Set up both the primary and the secondary transfers */
    DMA_CfgDescr(0, true, &descrCfg);
    DMA_CfgDescr(0, false, &descrCfg);
	/* Set up the first transfer */
	isPrimaryDMABuffer = true;
	
    DMA_ActivatePingPong(0,
        false,
        (void*)primaryBuffer,
        (void*)&(ADC0->SINGLEDATA),
        numberOfSamplesPerTransfer - 1,
        (void*)secondaryBuffer,
        (void*)&(ADC0->SINGLEDATA),
        numberOfSamplesPerTransfer - 1);
	/* Enable SRAM EXTERN */
	// Start address is 0x80000000, size is 256 * 1024 bytes
	// Clear PD11 --> CPU_FET_SRAM_EN_N
	GPIO->P[gpioPortE].DOUTCLR = 1 << 11;
	/* Enable the external bus interface */
	/* Enable clocks */
    CMU_ClockEnable(cmuClock_EBI, true);
	/* Enable SRAM EBI D0..07 data pins (PortE 8 -- 15)*/
    GPIO_PinModeSet(gpioPortE, 8, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 9, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 10, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 11, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 12, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 13, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 14, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 15, gpioModePushPull, 0);
    /* Enable SRAM EBI A0..15 address pins (PortA 15, 0 -- 6, PortE 1, PortC 9 - 10, PortE 4 -- 7, PortC 8, PortB 0 - 1)*/
    GPIO_PinModeSet(gpioPortA, 15, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortA, 0, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortA, 1, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortA, 2, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortA, 3, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortA, 4, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortA, 5, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortA, 6, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 1, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortC, 9, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortC, 10, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 4, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 5, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 6, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortE, 7, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortC, 8, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortB, 0, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortB, 1, gpioModePushPull, 0);
    /* Enable SRAM EBI CS0-CS1 (PortD 9 - 10)*/
    GPIO_PinModeSet(gpioPortD, 9, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortD, 10, gpioModePushPull, 0);
    /* Enable SRAM EBI WEN/OEN (PortF 8 - 9)*/
    GPIO_PinModeSet(gpioPortF, 8, gpioModePushPull, 0);
    GPIO_PinModeSet(gpioPortF, 9, gpioModePushPull, 0);
	/* Configure EBI controller, changing default values */
	EBI_Init_TypeDef ebiInit = EBI_INIT_DEFAULT;
    ebiInit.mode = ebiModeD8A8;
    ebiInit.banks = EBI_BANK0;
    ebiInit.csLines = EBI_CS0 | EBI_CS1;
    ebiInit.readHalfRE = true;
    ebiInit.aLow = ebiALowA8;
    ebiInit.aHigh = ebiAHighA18;
	/* Address Setup and hold time */
    ebiInit.addrHoldCycles  = 0;
    ebiInit.addrSetupCycles = 0;
	/* Read cycle times */
    ebiInit.readStrobeCycles = 3;
    ebiInit.readHoldCycles   = 1;
    ebiInit.readSetupCycles  = 2;
	/* Write cycle times */
    ebiInit.writeStrobeCycles = 6;
    ebiInit.writeHoldCycles   = 0;
    ebiInit.writeSetupCycles  = 0;
	ebiInit.location = ebiLocation1;
    /* Configure EBI */
    EBI_Init(&ebiInit);


