bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer/main.c
	/* Setup PRS (Peripheral Reflex System) between Timer and ADC */
	CMU_ClockEnable(cmuClock_PRS, true);
	CMU_ClockEnable(cmuClock_TIMER2, true);
	/* Connect PRS channel 0 to TIMER overflow */
	PRS_SourceSignalSet(0, PRS_CH_CTRL_SOURCESEL_TIMER2, PRS_CH_CTRL_SIGSEL_TIMER2OF, prsEdgeOff);
	/* Enable TIMER with default settings */
	TIMER_Init_TypeDef timerInit = TIMER_INIT_DEFAULT;
	timerInit.enable = false;
	TIMER_Init(TIMER2, &timerInit);
	/* Configure TIMER to trigger on sampling rate */
	TIMER_TopSet(TIMER2,  CMU_ClockFreqGet(cmuClock_TIMER2) / 8000 - 1);
	/* Enable Timer on ADC */
	TIMER_Enable(TIMER2, true);
	/* Start ADC sample */
	ADC_Start(ADC0, adcStartSingle);
	TerminateTask();
}
#define APP_Task_start_dma_STOP_SEC_CODE
#include "tpl_memmap.h"


#define APP_Task_copyDMAtoSRAM_START_SEC_CODE
#include "tpl_memmap.h"

#define SRAM_EXT_START_ADDR 0x80000000				/* EBI region 0 */

static int16_t buffer_sram[1024];

TASK(copyDMAtoSRAM){
	/* Configure DMA Channel 1 to transfer from DMA buffer to SRAM Extern */
	/* Initialise the DMA structure */
	// DMA_Init_TypeDef dmaInit1;
	// dmaInit1.hprot = 0;
	// dmaInit1.controlBlock = dmaControlBlock;
	// DMA_Init(&dmaInit1);
	// /* Setup channel */
	// DMA_CfgChannel_TypeDef chnlCfg1;
	// chnlCfg1.highPri = false;
    // chnlCfg1.enableInt = true;
	// chnlCfg1.select = 0; /* 0 because memory to memory transfer */
	// DMA_CfgChannel(1, &chnlCfg1);
	// /* Setting up channel descriptor */
    // DMA_CfgDescr_TypeDef descrCfg1;
	// descrCfg1.dstInc = dmaDataIncNone;
    // descrCfg1.srcInc = dmaDataIncNone;
    // descrCfg1.size = 1024;
	// descrCfg1.arbRate = dmaArbitrate1;
    // descrCfg1.hprot = 0;
	// /* Set up both the primary and the secondary transfers */
    // DMA_CfgDescr(1, true, &descrCfg1);
	/* Wait for event to transfer audio to sram */
	EventMaskType ev;
	WaitEvent(ev_DMAtoSRAM);
	GetEvent(copyDMAtoSRAM, ev);
	ClearEvent(ev);
	int16_t *buffer_dma;
	if(isPrimaryDMABuffer){
		buffer_dma = secondaryBuffer;
	}
	else{
		buffer_dma = primaryBuffer;
	}
	*buffer_sram = (int16_t *) SRAM_EXT_START_ADDR;
	for(uint16_t i = 0; i < 1024; i++){
		buffer_sram[i] = *buffer_dma++;
	}


	static int16_t check_buffer_sram[1024];
	for(uint16_t i = 0; i < 1024; i++){
		check_buffer_sram[i] = buffer_sram[i];
	}


	/* For testing only, we write 1 min to sd card, 8KHz --> 1024 points --> 469 buffers to write */
	static uint16_t cnt_write = 0;
	if(cnt_write < 1000){
		cnt_write++;
		f_open(&fileaudio, "audio.wav", FA_OPEN_APPEND | FA_WRITE);
		f_write(&fileaudio, check_buffer_sram, 2*1024, &bw);
		f_close(&fileaudio);
	}
	else{
		TerminateTask();
	}
	// DMA_ActivateBasic(1,			/* Channel 1*/
	// 	true,						/* primary cfg */
	// 	false,						/* no burst */
	// 	*buffer_sram,				/* dst */
	// 	*buffer_dma,				/* src */
	// 	1							/* 1 transfert */
	// );

	// static int16_t check_buffer_sram[1024];
	// for(uint16_t i = 0; i < 1024; i++){
	// 	check_buffer_sram[i] = buffer_sram[i];
	// }
	ChainTask(copyDMAtoSRAM);
	// TerminateTask();
}
#define APP_Task_copyDMAtoSRAM_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_Task_start_sdcard_START_SEC_CODE
#include "tpl_memmap.h"

static FATFS fatfs;

static void setTime(uint32_t time, uint32_t milliseconds) {
	/* 1024 tick per seconds */
    uint32_t ticks = ROUNDED_DIV(1024 * milliseconds, 1000);
    uint64_t intendedCounter = 1024 * (uint64_t)time + ticks;
    uint64_t offset = intendedCounter - (uint64_t)BURTC_CounterGet();
    BURTC_RetRegSet(1, (uint32_t)(offset >> 32));
    BURTC_RetRegSet(0, (uint32_t)(offset & 0xFFFFFFFF));
    BURTC_RetRegSet(2, 0x11223344);
	return;
}

static void getTime(uint32_t *time, uint32_t *milliseconds) {

    uint64_t offset =  (uint64_t)BURTC_RetRegGet(1) << 32;
    offset += (uint64_t)BURTC_RetRegGet(0);
    uint64_t currentCounter = offset + BURTC_CounterGet();

    if (time != NULL) {
        *time = currentCounter / 1024;
    }

    if (milliseconds != NULL) {
        uint32_t ticks = currentCounter % 1024;
        *milliseconds = ROUNDED_DIV(1000 * ticks, 1024);
    }
	return;
}

static void handleTimeOverflow(void) {
    uint32_t offsetHigh = BURTC_RetRegGet(1);
    BURTC_RetRegSet(1, offsetHigh + 1);
}

/* Time function for FAT file system */
DWORD get_fattime(void) {

    int8_t timezoneHours = 0;

    int8_t timezoneMinutes = 0;

    uint32_t currentTime;

    getTime(&currentTime, NULL);

    if (BURTC_IntGet() & BURTC_IF_OF) {
        handleTimeOverflow();
        getTime(&currentTime, NULL);
        BURTC_IntClear(BURTC_IF_OF);
    }

    time_t fatTime = currentTime + timezoneHours * 60 * 60 + timezoneMinutes * 60;

    struct tm timePtr;
	// return 0;
    gmtime_r(&fatTime, &timePtr);

    return (((unsigned int)timePtr.tm_year - 208) << 25) |
            (((unsigned int)timePtr.tm_mon + 1 ) << 21) |
            ((unsigned int)timePtr.tm_mday << 16) |
            ((unsigned int)timePtr.tm_hour << 11) |
            ((unsigned int)timePtr.tm_min << 5) |
            ((unsigned int)timePtr.tm_sec >> 1);
}


TASK(start_sdcard){
	GPIO_PinModeSet(gpioPortD, 12, gpioModePushPull, 1);
	/* Turn on SD card (PortD 12)*/
	GPIO_PinOutClear(gpioPortD, 12);
	/* Init */
	MICROSD_Init();
	/* Check SD card status */
	DSTATUS resCard = disk_initialize(0);
	if (resCard == STA_NOINIT || resCard == STA_NODISK || resCard == STA_PROTECT) {
        while(1);
    }
    /* Initialise file system */
    if (f_mount(&fatfs, "", 1) != FR_OK) {
        while(1);
    }

	const int duration_in_second = 128;				/* For example 1024/8000 = 0.128 s */


  	f_open(&fileaudio, "audio.wav", FA_OPEN_APPEND | FA_WRITE);
	/* Header detail of wav file */
	static wavHeader_t wavHeader = {
	 .riff = {.id = "RIFF", .size = 0},
		.format = "WAVE",
		.fmt = {.id = "fmt ", .size = sizeof(wavFormat_t)},
		.wavFormat = {.format = 1,							/* PCM format */
					  .numberOfChannels = 1,
					  .samplesPerSecond = 8000,				/* 8 KHz */
					  .bytesPerSecond = 2*8000,
					  .bytesPerCapture = 2,
					  .bitsPerSample = 16},
		.list = {.id = "LIST",
				 .size = 4 + sizeof(icmt_t) + sizeof(iart_t)},
		.info = "INFO",
		.icmt = {.icmt.id = "ICMT", .icmt.size = 0, .comment = ""},
		.iart = {.iart.id = "IART", .iart.size = 0, .artist = ""},
		.data = {.id = "data", .size = 0}
	};

	wavHeader.wavFormat.samplesPerSecond = 8000;
	wavHeader.wavFormat.bytesPerSecond = 2 * 8000;
	wavHeader.data.size = 2 * 8000 * duration_in_second;
	wavHeader.riff.size = 2 * 8000 * duration_in_second +
						   sizeof(wavHeader_t) - sizeof(chunk_t);
	f_write(&fileaudio, &wavHeader, sizeof(wavHeader_t), &bw);
	f_close(&fileaudio);
	TerminateTask();

