bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer/main.c
void input_output(matrix *output, matrix *input, uint16_t numFilters){
    /* copy output matrix and reference input to copied output */
    dma_load(MODEL_ARRAY_TEMP, output->data, output->numRows * output->numCols * numFilters);
    input->data = MODEL_ARRAY_TEMP;
    input->numRows = output->numRows;
    input->numCols = output->numCols;
}

int dma_load(int16_t* dest, int16_t* src, int n){
    int16_t i;
    for(i=n-1; i>=0; i--){
        dest[i] = src[i];
    }
    return n;
}


VAR(matrix, AUTOMATIC) inputFeatures = {
    .numRows = 1,
    .numCols = 1,
    .data = input_buffer,
};

VAR(matrix, AUTOMATIC) outputLabels = {
    .numRows = 1,
    .numCols = 1,
    .data = output_buffer,
};


TASK(inference){
	inputFeatures.data = input_buffer;
	inputFeatures.numRows = 1;
	inputFeatures.numCols = 1;

	outputLabels.data = output_buffer;
	outputLabels.numRows = 1;
	outputLabels.numCols = 1;

	matrix *input = &inputFeatures;
	matrix *output = &outputLabels;

	int16_t *bias_array;

	matrix kernel;
	matrix bias;
	uint16_t layer_class, activation, numChannels, filter_numRows, filter_numCols, stride_numRows, stride_numCols, filters_length, padding;
    uint16_t numFilters;

	/* ----- Conv1D_2 ----- */
	activation = conv1d_2_layer.activation;
	numFilters = conv1d_2_layer.numFilter;
	numChannels = conv1d_2_layer.numChannels;
	filter_numRows = conv1d_2_layer.filterRows;
	filter_numCols = conv1d_2_layer.filterCols;
	stride_numRows = conv1d_2_layer.strideRows;
	stride_numCols = conv1d_2_layer.strideCols;
	filters_length = conv1d_2_layer.filterLen;
	padding = conv1d_2_layer.padding;

	if(padding==1){
		output->numRows = input->numRows / stride_numRows;
		if(input->numRows % stride_numRows > 0){
			output->numRows++;
		}
		output->numCols = input->numCols / stride_numCols;
		if(input->numCols % stride_numCols > 0){
			output->numCols++;
		}
	}
	else{
		output->numRows = (input->numRows - filter_numRows + 1) / stride_numRows;
        if ((input->numRows - filter_numRows + 1) % stride_numRows > 0){
            output->numRows ++;
        }
        output->numCols = (input->numCols - filter_numCols + 1) / stride_numCols;
        if ((input->numCols - filter_numCols + 1) % stride_numCols > 0){
            output->numCols ++;
        }
	}
	int16_t *filters_array = conv1d_2_layer.weight;
    matrix filters = {filters_array, filter_numRows, filter_numCols};
    bias_array = conv1d_2_layer.bias;
	// execute conv1d layer
    if (activation == RELU_ACTIVATION){
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_relu, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
    else if (activation == SIGMOID_ACTIVATION){
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_sigmoid, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
    else{
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_linear, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
	input_output(output, input, numFilters);

	/* ----- MAX POOLING_2 ----- */
	uint16_t pool_numRows = max_pooling1d_2_layer.poolRows;
    uint16_t pool_numCols = max_pooling1d_2_layer.poolCols;
    stride_numRows = max_pooling1d_2_layer.strideRows;
    stride_numCols = max_pooling1d_2_layer.strideCols;
    padding = max_pooling1d_2_layer.padding;

    output->numRows = input->numRows / pool_numRows;
    output->numCols = input->numCols / pool_numCols;
	maxpooling_filters(output, input, numFilters, pool_numRows, pool_numCols);
    input_output(output, input, numFilters);

	/* ----- Conv1D_3 ----- */
	activation = conv1d_3_layer.activation;
	numFilters = conv1d_3_layer.numFilter;
	numChannels = conv1d_3_layer.numChannels;
	filter_numRows = conv1d_3_layer.filterRows;
	filter_numCols = conv1d_3_layer.filterCols;
	stride_numRows = conv1d_3_layer.strideRows;
	stride_numCols = conv1d_3_layer.strideCols;
	filters_length = conv1d_3_layer.filterLen;
	padding = conv1d_3_layer.padding;

	if(padding==1){
		output->numRows = input->numRows / stride_numRows;
		if(input->numRows % stride_numRows > 0){
			output->numRows++;
		}
		output->numCols = input->numCols / stride_numCols;
		if(input->numCols % stride_numCols > 0){
			output->numCols++;
		}
	}
	else{
		output->numRows = (input->numRows - filter_numRows + 1) / stride_numRows;
        if ((input->numRows - filter_numRows + 1) % stride_numRows > 0){
            output->numRows ++;
        }
        output->numCols = (input->numCols - filter_numCols + 1) / stride_numCols;
        if ((input->numCols - filter_numCols + 1) % stride_numCols > 0){
            output->numCols ++;
        }
	}
	filters_array = conv1d_3_layer.weight;
	filters.data = filters_array;
    filters.numRows = filter_numRows;
    filters.numCols = filter_numCols;    
	bias_array = conv1d_3_layer.bias;
	// execute conv1d layer
    if (activation == RELU_ACTIVATION){
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_relu, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
    else if (activation == SIGMOID_ACTIVATION){
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_sigmoid, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
    else{
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_linear, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
	input_output(output, input, numFilters);

	/* ----- MAX POOLING_3 ----- */
	pool_numRows = max_pooling1d_3_layer.poolRows;
    pool_numCols = max_pooling1d_3_layer.poolCols;
    stride_numRows = max_pooling1d_3_layer.strideRows;
    stride_numCols = max_pooling1d_3_layer.strideCols;
    padding = max_pooling1d_3_layer.padding;

    output->numRows = input->numRows / pool_numRows;
    output->numCols = input->numCols / pool_numCols;
	maxpooling_filters(output, input, numFilters, pool_numRows, pool_numCols);
    input_output(output, input, numFilters);

	/* ----- Conv1D_4 ----- */
	activation = conv1d_4_layer.activation;
	numFilters = conv1d_4_layer.numFilter;
	numChannels = conv1d_4_layer.numChannels;
	filter_numRows = conv1d_4_layer.filterRows;
	filter_numCols = conv1d_4_layer.filterCols;
	stride_numRows = conv1d_4_layer.strideRows;
	stride_numCols = conv1d_4_layer.strideCols;
	filters_length = conv1d_4_layer.filterLen;
	padding = conv1d_4_layer.padding;

	if(padding==1){
		output->numRows = input->numRows / stride_numRows;
		if(input->numRows % stride_numRows > 0){
			output->numRows++;
		}
		output->numCols = input->numCols / stride_numCols;
		if(input->numCols % stride_numCols > 0){
			output->numCols++;
		}
	}
	else{
		output->numRows = (input->numRows - filter_numRows + 1) / stride_numRows;
        if ((input->numRows - filter_numRows + 1) % stride_numRows > 0){
            output->numRows ++;
        }
        output->numCols = (input->numCols - filter_numCols + 1) / stride_numCols;
        if ((input->numCols - filter_numCols + 1) % stride_numCols > 0){
            output->numCols ++;
        }
	}
	filters_array = conv1d_4_layer.weight;
	filters.data = filters_array;
    filters.numRows = filter_numRows;
    filters.numCols = filter_numCols;    
	bias_array = conv1d_4_layer.bias;
	// execute conv1d layer
    if (activation == RELU_ACTIVATION){
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_relu, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
    else if (activation == SIGMOID_ACTIVATION){
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_sigmoid, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
    else{
        conv2d(output, input, &filters, numFilters, numChannels, bias_array, &fp_linear, FIXED_POINT_PRECISION, stride_numRows, stride_numCols, padding);
    }
	input_output(output, input, numFilters);

	/* ----- Global Average Pooling 1D -----*/
	output->numRows = numFilters;
	output->numCols = 1;
	globalAveragePooling(output, input, numFilters);
    numFilters = 1;
    input_output(output, input, numFilters);
	/* ----- DENSE_4 -----*/
    numFilters = 1;
    activation = dense_4_layer.activation;

    output->numRows = dense_4_layer.kernel_numRows;
    output->numCols = input->numCols;

    kernel.data = dense_4_layer.weight;
    kernel.numRows = dense_4_layer.kernel_numRows;
    kernel.numCols = dense_4_layer.kernel_numCols;

    bias.data = dense_4_layer.bias;
    bias.numRows = dense_4_layer.bias_numRows;
    bias.numCols = dense_4_layer.bias_numCols;

    if (activation == RELU_ACTIVATION){
        dense(output, input, &kernel, &bias, &fp_relu, FIXED_POINT_PRECISION);
    }
    else if (activation == SIGMOID_ACTIVATION){
        dense(output, input, &kernel, &bias, &fp_sigmoid, FIXED_POINT_PRECISION);
    }
    else{
        dense(output, input, &kernel, &bias, &fp_linear, FIXED_POINT_PRECISION);
    }
    input_output(output, input, numFilters);
	/* ----- DENSE_5 -----*/
    numFilters = 1;
    activation = dense_5_layer.activation;

    output->numRows = dense_5_layer.kernel_numRows;
    output->numCols = input->numCols;

    kernel.data = dense_5_layer.weight;
    kernel.numRows = dense_5_layer.kernel_numRows;
    kernel.numCols = dense_5_layer.kernel_numCols;

    bias.data = dense_5_layer.bias;
    bias.numRows = dense_5_layer.bias_numRows;
    bias.numCols = dense_5_layer.bias_numCols;

    if (activation == RELU_ACTIVATION){
        dense(output, input, &kernel, &bias, &fp_relu, FIXED_POINT_PRECISION);
    }
    else if (activation == SIGMOID_ACTIVATION){
        dense(output, input, &kernel, &bias, &fp_sigmoid, FIXED_POINT_PRECISION);
    }
    else{
        dense(output, input, &kernel, &bias, &fp_linear, FIXED_POINT_PRECISION);
    }
    input_output(output, input, numFilters);

	/* Classification */
	label = argmax(output);
	TerminateTask();
}
#define APP_Task_inference_STOP_SEC_CODE
#include "tpl_memmap.h"